/*Дед Мороз и Снегурочка приходят на детские утренники с мешком конфет. Дед
Мороз делит конфеты поровну между всеми присутствующими детьми (детей на
утреннике никогда не бывает больше 100), а оставшиеся конфеты отдает
Снегурочке. Снегурочка каждый раз записывает в блокнот количество полученных
конфет. Если конфеты разделились между всеми детьми без остатка, Снегурочка
ничего не получает и ничего не записывает. Когда утренники закончились, Деду
Морозу стало интересно, какое число чаще всего записывала Снегурочка. Дед
Мороз и Снегурочка — волшебные, поэтому число утренников N, на которых они
побывали, может быть очень большим. Напишите программу, которая будет
решать эту задачу. */

#include <iostream>
using namespace std;
int main() 
{
	int MAX = 100, N, D, K, imax, remainder;
	int *a = new int[MAX - 1];
	for (int i = 0; i < MAX - 1; i++)
		a[i] = 0;
	cin >> N;
	for (int i = 0; i < N; i++) 
  {
		cin >> D >> K;
		remainder = K % D;
		if (remainder > 0) 
			a[remainder] = a[remainder] + 1;
	}
	imax = 1;
	for (int i = 1; i < MAX - 1; i++)
  {
		if (a[i] >= a[imax]) 
			imax = i;
	}
	if (a[imax] == 0) 
		imax = 0;
	delete []a;
	cout << imax;
	return 0;
}
