/*Гоночная трасса состоит из двух основных дорог и нескольких переездов,
позволяющих перейти с одной дороги на другую. На всех участках, включая
переезды, движение разрешено только в одну сторону, поэтому переезд возможен
только с дороги A на дорогу B. Гонщик стартует в точке A0 и должен финишировать
в точке BN. Он знает, за какое время сможет пройти каждый участок пути по каждой
дороге, то есть время прохождения участков A0A1, A1A2, …, AN-1AN, B0B1, B1B2, …,
BN-1BN. Время прохождения всех переездов A0B0, A1B1, …, ANBN одинаково и
известно гонщику. Необходимо определить, за какое минимальное время гонщик
сможет пройти трассу.*/

#include "pch.h"
#include <iostream>
using namespace std;
int main()
{
	int N, t, A, B, X, Y, Y1, Y2;
	cin >> N;
	cin >> t;
	X = 0;
	Y = t;
	for(int i = 1; i <= N; i++)
	{
		cin >> A >> B;
		X = X + A;
		Y1 = Y + B;
		Y2 = X + t;
		if(Y1 < Y2) 
			Y = Y1;
		else 
			Y = Y2;
	}
	cout << Y;
	return 0;
}
